{
  "meta title professional info": "Профессиональная информация",
  "description professional info": "Моя профессиональная информация, очень профессиональная, но я поделюсь ею с вами.",
  "title professional info": "Видеть всю информацию о [профессиональная информация], разложенную по папкам, — отличный способ оставаться организованным и легко получать доступ к нужной информации.",
  "meta title pdf template": "Шаблонизатор pdf",
  "meta description pdf template": "Я работал в составе команды, разрабатывающей корпоративную систему для работы с PDF-документами.",
  "pdf template content professional info": "Я был частью команды, которая разрабатывала корпоративную систему для работы с PDF-документами. Наша система включала механизм шаблонов, который позволял пользователям создавать свои собственные шаблоны и добавлять их в общедоступную библиотеку. Эти шаблоны создавались из настраиваемых блоков, что делало их легко адаптируемыми к широкому спектру вариантов использования. Наш основной технологический стек был построен на React и MobX, что помогло нам создать интуитивно понятный и удобный интерфейс. Для обеспечения качества нашего кода мы использовали линтеры и писали тесты для раннего выявления потенциальных проблем. Вместе с моей командой мы использовали GitLab в качестве системы контроля версий, что позволило нам эффективно сотрудничать и отслеживать изменения. Мы также следовали методологии agile, чтобы оставаться организованными и сосредоточенными на достижении качественных результатов. Для создания стилей мы использовали Styled Components для создания многократно используемых и хорошо комбинируемых компонентов пользовательского интерфейса. Это позволило нам легко управлять таблицами стилей и обеспечить согласованность во всем приложении. А чтобы убедиться, что все работают над нужными задачами в нужное время, мы использовали систему отслеживания задач, которая позволяла нам не отставать от графика. В целом, работа в команде над этим проектом была полезным опытом, который помог мне развить ценные навыки разработчика.",
  "meta title trello": "Трелло",
  "meta description trello": "Будучи младшим frontend разработчиком в стартапе, я был частью команды из 10 человек, разрабатывающей приложение, похожее на Trello.",
  "trello content professional info": "Будучи младшим frontend разработчиком в стартапе, я был частью команды из 10 человек, создававшей приложение, похожее на Trello. Для создания проекта мы использовали React, Redux, CSS-модули, Jest и Enzyme. Чтобы улучшить процесс разработки и само приложение, мы также использовали Figma, инструмент для проектирования, который позволял нашим дизайнерам и разработчикам сотрудничать над проектами в режиме реального времени. В мои основные обязанности входила работа над пользовательским интерфейсом приложения, разработка новых функций и исправление ошибок. Для обеспечения высокого качества кода мы использовали разработку на основе тестирования (TDD) и писали модульные тесты для наших компонентов. Мы также использовали непрерывную интеграцию и непрерывное развертывание (CI/CD) для оптимизации процесса разработки и развертывания. Мы использовали Travis CI для автоматической сборки и тестирования нашего кода при каждом внесении изменений в репозиторий. Если сборка и тесты проходили успешно, код автоматически развертывался в среду постановки для дальнейшего тестирования перед развертыванием в производство. Мы использовали Git в качестве системы контроля версий и GitHub для управления нашими репозиториями. Мы также использовали JIRA для отслеживания проблем и управления проектами. Общение и сотрудничество были ключом к нашему успеху, поэтому мы регулярно проводили видеоконференции и использовали Slack для обмена сообщениями и обновлениями. Мой опыт работы с Figma был положительным. Она позволила нам более эффективно сотрудничать при принятии проектных решений и обеспечила соответствие нашей разработки общему дизайну приложения. Работа в команде из 10 человек дала мне ценный опыт и навыки общения в удаленной команде, управления проектами, TDD и CI/CD. В целом, мне понравилось работать в Startup, и я благодарен за возможность поработать над таким интересным проектом."
}
