{
  "meta title professional info": "Professional Info",
  "meta description professional info": "My professional information, very professional, but I will share it with you.",
  "title professional info": "To see all the information about [professional-info], arranged in folders, is a great way to stay organized and easily access the information you need.",
  "meta title pdf template": "Pdf templated",
  "meta description pdf template": "I worked as part of a team developing a corporate system for working with PDF documents.",
  "pdf template content professional info": "I was part of a team that developed an enterprise system for working with PDF documents. Our system included a template engine that allowed users to create their own templates and add them to a publicly available library. These templates were built from customizable blocks, making them highly adaptable to a wide range of use cases. Our main technology stack was built around React and MobX, which helped us create an intuitive and user-friendly interface. To ensure the quality of our code, we used linters and wrote tests to catch potential issues early. Together with my team, we used GitLab as our version control system, which allowed us to collaborate efficiently and track changes effectively. We also followed agile methodologies to stay organized and focused on delivering quality results. For styling, we used Styled Components to create reusable and highly composable UI components. This allowed us to easily manage our stylesheets and ensure consistency across the application. And to make sure everyone was working on the right tasks at the right time, we used a task tracking system that kept us on track and on schedule. Overall, working as part of a team on this project was a rewarding experience that helped me develop valuable skills as a developer.",
  "meta title trello": "Trello",
  "meta description trello": "As a junior frontend developer at the startup, I was part of a team of 10 people developing an application similar to Trello.",
  "trello content professional info": "As a junior frontend developer at the startup, I was part of a team of 10 people building an application similar to Trello. We used React, Redux, CSS modules, Jest, and Enzyme to build the project. To improve our development process and the application itself, we also used Figma, a design tool that allowed our designers and developers to collaborate on designs in real time. My main responsibility was to work on the front end of the application, developing new features and fixing bugs. To ensure high quality code, we used test-driven development (TDD) and wrote unit tests for our components. We also used continuous integration and continuous deployment (CI/CD) to streamline our development and deployment process. We used Travis CI to automatically build and test our code whenever changes were pushed to the repository. If the build and tests passed, the code was automatically deployed to a staging environment for further testing before being deployed to production. We used Git as our version control system and GitHub to manage our repositories. We also used JIRA for issue tracking and project management. Communication and collaboration were key to our success, and we held regular video conferences and used Slack for messaging and updates. My experience with Figma has been positive. It allowed us to collaborate more effectively on design decisions and ensured that our development was in line with the overall design of the application. Working in a team of 10 people provided me with valuable experience and skills in remote team communication, project management, TDD, and CI/CD. Overall, I enjoyed my time at Startup and am grateful for the opportunity to work on such an exciting project."
}
